[
  {
    "name": "Palm Springs",
    "platform": "Amazon",
    "description": "I only recently saw this and I would recommend you check it out. It is sweet and funny and the two leads are great together. It´s another infinite time loop story, like Groundhog Day."
  },
  {
    "name": "Sicario",
    "platform": "Amazon",
    "description": "A drug movie by my favorite director Denis Villeneuve. It is just so intense, right from the first scene. It is kind of tough to watch at times, but always in service of the story. Emily Blunt plays a young FBI agent who is ordered to the Mexican Border. And the cinematography is truly amazing at times."
  },
  {
    "name": "Train to Busan",
    "platform": "Amazon",
    "description": "I am currently waiting for the sequel for this korean zombie/horror movie. This might not sound like your type of movie, but I think it is pretty accessible. And like most korean movies, it has some deeper meaning to it than just zombies. And it features the best performance by a child actress I have ever seen.",
    "link": "https://www.youtube.com/watch?v=pyWuHv2-Abk"
  },
  {
    "name": "Memories of Murder",
    "platform": "Amazon",
    "description": "For those who want to see more by the director of Parasite, Bong Joon-Ho. This is one of his earlier movies and I would say a korean classic. Telling the story of one of South Koreas earliest serial murderers, it is absolutely creepy and exciting."
  },
  {
    "name": "Call me by your name",
    "platform": "Amazon",
    "description": "This one is great. It featured the the breakout role for Timothée Chalamet and got a lot of attention when it came out. A gay love story set in the 80s in italy, this is one of the most beautiful movies I know. The atmosphere and music are great, and so are the performances."
  },
  {
    "name": "Booksmart",
    "platform": "Amazon",
    "description": "The directorial debut of Olivia Wilde. It is kind of a raunchy teen comedy about two overachieving girls who want to party on their last night of high school. But I found it had some more meaning to it as well. And it starrs Kaitlyn Dever from Unbelievable!"
  },
  {
    "name": "GoodFellas",
    "platform": "Netflix",
    "description": "I feel stupid recommending this, it is one of the biggest movies of all time. But it is one of the few mob movies I would recommend, Martin Scorsese was just born to make movies. It is about the mafia."
  },
  {
    "name": "Once Upon a Time in Hollywood",
    "platform": "Netflix",
    "description": "I like this movie because it is not the typical Tarantino movie. It is exceptionally well made, with huge sets and attention to detail, and it features great performances. Just make sure you know who Sharon Tate is before watching this. In the US this is common knowledge, and the movie was made for an US audience."
  },
  {
    "name": "Blue Jay",
    "platform": "Netflix",
    "description": "Very sweet and funny love story with a real emotional core, with Mark Duplass and Sarah Paulson. You should see it. It is less pretentious and artsy than it looks like.",
    "link": "https://www.youtube.com/watch?v=2htQEBF1fCc"
  },
  {
    "name": "Senna",
    "platform": "Mubi",
    "description": "A documentary about Ayrton Senna, the Formula One driver. This is the example for a well made documentary, it transports you to 1988 and is incredibly stylish while telling an exciting story.",
    "link": "https://www.youtube.com/watch?v=QOQLeqRcgKc"
  },
  {
    "name": "The Invitation",
    "platform": "Netflix",
    "description": "Another exciting movie. It is not perfect but kind of a gateway horror movie. It is about a kind of culty dinner invitation."
  },
  {
    "name": "Don´t Breathe",
    "platform": "Netflix",
    "description": "I am going to talk about some exciting movies. This is one of them, if you just want to watch a 90 minute thriller, this is it. It is somewhat intense, though. Some kids are breaking into a house, but are met by a blind army vet who is more than able to deal with them."
  },
  {
    "name": "Room",
    "platform": "Netflix",
    "description": "Brie Larson´s and Jacob Tremblay´s breakout roles. It is pretty grim and emotional but very well acted and engaging. It is about a mother and her son in captivity."
  },
  {
    "name": "Blackfish",
    "platform": "Netflix",
    "description": "A Documentary about the mistreatment of animals in parks similar to sea world. I have seen it some time ago so I cant describe it in detail, but it´s good."
  },
  {
    "name": "Shutter Island",
    "platform": "Netflix",
    "description": "Another movie you probably already know. But it is on Netflix so if you have not seen it, check it out. A Thriller featuring Leonardo Di Caprio."
  },
  {
    "name": "No Country for Old Men",
    "platform": "Netflix",
    "description": "This is an absolute classic, I am not sure if I have to talk about it. A modern western about a sheriff who encounters a gruesome crime scene, it features on of the best performances of all time by Javier Bardem."
  },
  {
    "name": "Bo Burnham: Inside",
    "platform": "Netflix",
    "description": "Bo Burnham is one of my favorite comedians and I loved every stand up special of his. This new one was shot over the course of the pandemic, entirely inside the same room. And it is a pretty amazing display of his creativity."
  },
  {
    "name": "Good Boys",
    "platform": "Amazon",
    "description": "This is like Superbad but the children are even younger. I was pleasently surprised about how funny it was. They actors actually act like children. Its about three boys who go to their first 'kissing party'."
  },
  {
    "name": "My Octopus Teacher",
    "platform": "Netflix",
    "description": "Nominated for the Academy Award for Best Documentary. Within the first 10 minutes you just know this is special. I was very surprised by it, it is gorgeous."
  },
  {
    "name": "Framing Britney Spears",
    "platform": "Amazon",
    "description": "Recently I watched the documentaries 'Amy' about Amy Winehouse (Mubi) and 'The World´s a little blurry' about Billie Eilish (Apple TV+), so this is the third movie about a female superstar I´ve watched. Comparing them is pretty fascinating but even on its own this movie is almost a must-see. It is unbelievable."
  },
  {
    "name": "The Dead Don´t Die",
    "platform": "Amazon",
    "description": "If the names Adam Driver and Jim Jarmusch mean anything to you, you know why you got to see this. Otherwise I would recommend this to a certain audience, I found it to be pretty funny.",
    "link": "https://www.youtube.com/watch?v=bs5ZOcU6Bnw"
  },
  {
    "name": "The Art of Self Defense",
    "platform": "Amazon",
    "description": "This was the opening movie for the 2019 Munich Film Festival. It is definitely worth a watch. But it gets darker than even I would have anticipated",
    "link": "https://www.youtube.com/watch?v=7Bms6Hba-3A"
  },
  {
    "name": "Quincy",
    "platform": "Netflix",
    "description": "I think there is a strong argument to be made that no other single person influenced modern pop culture and music like Quincy Jones. This documentary is pretty good, made by his daughter Rashida Jones who you might know."
  },
  {
    "name": "The Big Sick",
    "platform": "Amazon",
    "description": "Extremely well received at the time. It is one of the best rom-coms I know, so much so that it transcends the genre and becomes just a good movie. And Bo Burnham is in it?!",
    "link": "https://www.youtube.com/watch?v=jcD0Daqc3Yw"
  },
  {
    "name": "Ham on Rye",
    "platform": "Mubi",
    "description": "I am still trying to get people to subscribe to Mubi. This was extremely refreshing and genuinely very funny. It is like the artsy version of Eigtht Grade.",
    "link": "https://www.youtube.com/watch?v=X6xtcQDPF20"
  },
  {
    "name": "Fruitvale Station",
    "platform": "Netflix",
    "description": "This is such a necessary film to watch. It´s early work from Ryan Coogler (director of Black Panther and Creed), starring Michael B. Jordan and with music from Ludwig Göransson (Mandalorian, Black Panther, and everything else by now). The performance of Jordan is something else.",
    "link": "https://www.youtube.com/watch?v=vHkKUPHn8TE"
  },
  {
    "name": "10 Cloverfield Lane",
    "platform": "Amazon",
    "description": "You definitely do not have to have seen Cloverfield for this. This is just such a claustrophobic, exciting and well executed movie. If it wasn´t for the last 10 minutes or so... You can really see the discrepancy between the filmmakers and studio interests.",
    "link": "https://www.youtube.com/watch?v=saHzng8fxLs"
  },
  {
    "name": "The VVitch",
    "platform": "Netflix",
    "description": "One of my all-time favorite horror movies and my favorite movie of 2016. Netflix uploaded a few movies of Anya Taylor-Joy because of Queens Gambit, Thoroughbreds being another good one. Back to The VVitch. It is not very violent but incredibly moody and tense. It is also Robert Eggers directoral debut which is crazy.",
    "link": "https://www.youtube.com/watch?v=iQXmlf3Sefg"
  },
  {
    "name": "The Place Beyond the Pines",
    "platform": "Amazon",
    "description": "I have not seen this in a while but I remember it very fondly. It is not what you expect from it but it is very well made, exciting and kind of moving?",
    "link": "https://www.amazon.de/gp/video/detail/B00I84GPFE/ref=atv_dp_share_cu_r"
  },
  {
    "name": "Eighth Grade",
    "platform": "Netflix",
    "description": "Bo Burnham is one of my all-time favorite comedians and this is his first feature film. I absolutely love it. It is funny and sweet and unique and very charming. It has a 99% score on rotten tomatoes and I would like to speak to the 1% to find out what is wrong with them.",
    "link": "https://www.netflix.com/search?q=eig&jbv=80238596"
  },
  {
    "name": "American Animals",
    "platform": "Amazon",
    "description": "This is something special. It´s a fusion of documentary and feature and is unlike anything I have ever seen. I think this is way overlooked.",
    "link": "https://www.amazon.de/gp/video/detail/B07MDX77KH/ref=atv_dp_share_cu_r"
  },
  {
    "name": "Mid 90s",
    "platform": "Mubi",
    "description": "The marketing angle: this is the directorial debut of Jonah Hill. It´s a coming-of-age film about friendship and pretty nostalgic.",
    "link": "https://mubi.com/films/mid-90s"
  },
  {
    "name": "The Wailing",
    "platform": "Amazon",
    "description": "Please, I want to talk to someone about this! It is a korean horror movie. And one of the most gripping and insane movies I know. It is truly a horror masterpiece. Korean cinema has a lot more to offer than Parasite.",
    "link": "https://www.amazon.de/gp/video/detail/B076BYV5BX/ref=atv_dp_share_cu_r"
  },
  {
    "name": "Hell Or High Water",
    "platform": "Netflix",
    "description": "I like a good crime story, and this reminded my a lot of No Country for Old Men, mostly because of the setting of course. It was nominated for Best Picture, and is written by Taylor Sheridan who also wrote Sicario and Wind River.",
    "link": "https://www.netflix.com/title/80108616?s=a&trkid=13747225&t=cp"
  },
  {
    "name": "Paddleton",
    "platform": "Netflix",
    "description": "I am always interested in what Mark Duplass does, so I watched this without knowing too much else about it. It is a mostly improvised mumblecore movie, and it is deeply emotional. You should be patient with it though."
  },
  {
    "name": "Wind River",
    "platform": "Netflix",
    "description": "I remember seeing this in a sneak preview and being the one of my friends who liked it the most. I don´t know why anymore. But I still would recommend it. The atmosphere is great and it has a lot of emotional and intense moments. If you find Jeremy Renner off-putting, I get it. But give it a chance."
  },
  {
    "name": "Battle of the Sexes",
    "platform": "Netflix",
    "description": "This came on in a sneak preview a while back. I enjoyed it more than I thought I would."
  },
  {
    "name": "Three Billboards outside Ebbing, Missouri",
    "platform": "Netflix",
    "description": "Time really flew by with this one. It might be to crass for some, because most people depicted in this are horrible in some way. But there is so much great stuff about it, especially Frances McDormand who won the Academy Award for Best Lead Actress that year."
  },
  {
    "name": "Thunder Road",
    "platform": "Mubi",
    "description": "Written, directed and performed by Jim Cummings. It is just impressive, Jim Cummings is extremely talented. If you are in the mood for a sweet Indie movie, this is one option. I try to feature more stuff from mubi, you should consider getting the free month trial. This spring, the first three months are just 33 cents each. Otherwise I could send you a link for a free month trial. "
  },
  {
    "name": "The Florida Project",
    "platform": "Amazon",
    "description": "It is not for free on amazon, but it is on sale very often and also on the Arthouse CNMA channel. I love this, and I do not exactly know why. Maybe it is because of the main child actress Brooklyn Prince, or Willem Dafoe, or the constant swearing, or the adventure."
  },
  {
    "name": "The Babadook",
    "platform": "Amazon",
    "description": "The trailer makes this look so incredibly violent but it is not. It is a horror movie though. But it is also more than that. Jennifer Kent is the writer/director, in 2019 she made The Nightingale, which is one of the most unsettling movies I have seen."
  },
  {
    "name": "Us",
    "platform": "Amazon",
    "description": "The second movie of Jordan Peele after Get Out. Thus expectations were incredibly high, but Us still delievered. It has horror elements but I would call this more of a thriller. It is of course creepy but in the best possible way."
  },
  {
    "name": "Upgrade",
    "platform": "Amazon",
    "description": "Pretty good action movie. The fight scenes are fun and creative, and overall it is perfect for a rainy sunday afternoon or something."
  },
  {
    "name": "Parasite",
    "platform": "Amazon",
    "description": "Again, you already know this one. It is on amazon, and it is great. Even if you watched it already, watch it again. In the original version with subtitles of course."
  },
  {
    "name": "The Shape of Water",
    "platform": "Netflix",
    "description": "I should not have to tell you about this, it won the Oscar for best picture. But if you have not seen it, now is your chance."
  },
  {
    "name": "My Neighbor Totoro",
    "platform": "Netflix",
    "description": "Studio Ghibli is just amazing. I only saw My Neighbor Totoro recently. Despite the lack of a central protagonist, jokes, any threat or villain, a beginning or an end, this is one of the best animation movies ever made."
  },
  {
    "name": "Sound of Metal",
    "platform": "Amazon",
    "description": "An original screenplay? Shot on film? In 2020? Even even the bar was higher you should see it. It is heart-warming, Riz Ahmed is great, and so is the entire cast."
  },
  {
    "name": "Moonrise Kingdom",
    "platform": "Netflix",
    "description": "A film by Wes Anderson that you have heard of but do not know is on Netflix. It is pretty sweet, features an impressive cast and is overall just nice to watch."
  },
  {
    "name": "The Assistant",
    "platform": "Amazon",
    "description": "Even though you might have to pay for this I would recommend this to almost everyone. It takes place in what seems to be an ordinary setting, but kept me engaged the entire time. It is slow but nevertheless exciting, and it starrs Julia Garner."
  },
  {
    "name": "Blackpink",
    "platform": "Netflix",
    "description": "A Documentary about K-Pop. I wanted to know what the hype about this genre is about, so I watched this. It is pretty informative and exposes you to a part of pop culture you might not have been exposed to otherwise."
  },
  {
    "name": "I am thinking of ending things",
    "platform": "Netflix",
    "description": "A weird one which is kind of hard to recommend. But if you feel that you have seen everything, go see this. I think I have to see this more times to completely get it, or to get it at all."
  },
  {
    "name": "Nightcrawler",
    "platform": "Netflix",
    "description": "Another Jake Gyllenhaal favorite. It is pretty great, I think even one of my favorites. It is dark but nothing you cannot handle. This was also the first time I noticed Riz Ahmed and since then I kind of follow his career, too. He is also in Una, The Sisters Brothers and Sound of Metal"
  },
  {
    "name": "The forty-year-old version",
    "platform": "Netflix",
    "description": "Written and directed by Radha Blank, who also plays the main role, this is about a drama teacher who decides to become a rapper. It is funny and heartfelt and looks great."
  },
  {
    "name": "Incendies",
    "platform": "Mubi",
    "description": "The first major movie by Denis Villeneuve and the last one of him I have seen. It is mostly in french, and it is pretty grim. But it is exactly what you would expect from the director."
  },
  {
    "name": "Knives Out",
    "platform": "Amazon",
    "description": "Who would have thought Rian Johnson would get to make another movie after The Last Jedi. This is it, and it is a fun little Whodunit with a great cast."
  },
  {
    "name": "Super Dark Times",
    "platform": "Amazon",
    "description": "Pretty intense thriller. It is so low key, but it is riveting and sometimes infuriating. I remember it to look awesome, too."
  },
  {
    "name": "Marriage Story",
    "platform": "Netflix",
    "description": "You should know this one by now. It starrs Adam Driver so of course it is going to appear here. Noah Baumbach made movies in the past that made me think of him as pretentious, but not this one. It is very good."
  },
  {
    "name": "It comes at night",
    "platform": "Netflix",
    "description": "I can´t keep saying that movies are thrilling. I love A24, and the majority of movies they put out, this one included. The atmosphere is this is extremely well done, and the posters were amazing, too. The trailer makes it seem more like a horror movie than it acutally is, so give it chance."
  },
  {
    "name": "The Sisters Brothers",
    "platform": "Amazon",
    "description": "Even though I rarley see Westerns, I very much enjoyed this. Starring Joaquin Phoenix, Jake Gyllenhaal, John C. Riley and Riz Ahmed."
  },
  {
    "name": "Burning",
    "platform": "Amazon",
    "description": "I guess this is the movie I think about the most, it is currently in my top three favorite movies. To be brief, I was just so immersed into this. The world feels so lived-in, the performances are great, and it is one of the best looking films I have ever seen. I just watched it again to make sure and it is still a masterpiece. But don´t text me saying it is boring, or else! And of course, watch it with subtitles."
  },
  {
    "name": "Prisoners",
    "platform": "Netflix",
    "description": "My favorite movie for a long time. I guess when i first saw this, no other movie has been this thrilling. I was on the edge of my seat the entire time. My love for Denis Villeneuve really started with this one."
  },
  {
    "name": "Arrival",
    "platform": "Amazon",
    "description": "You have to see this because it is from Denis Villeneuve. One of the best science fiction movies because it seems so real. The score is absolutely beautiful. Sadly, the composer Johann Johannsson died in 2018."
  },
  {
    "name": "American Factory",
    "platform": "Netflix",
    "description": "Produced by the Obamas, this documentary won the academy award. Maybe you think you do not care about the subject matter, but I think you will still enjoy this."
  },
  {
    "name": "Okja",
    "platform": "Netflix",
    "description": "You should see any movie by Bong Joon-Ho that you can find. Please still watch them in the original with subtitles. This one is on Netflix and large parts of it are in english so it is the perfect gateway."
  },
  {
    "name": "Uncut Gems",
    "platform": "Netflix",
    "description": "Extremely anxiety inducing but also entertaining and one of the most talked about movies of 2019. This is not an Adam Sandler movie. If you enjoy it, you can also watch Good Times on Amazon, by the same directors and starring Robert Pattinson."
  },
  {
    "name": "Annihilation",
    "platform": "Netflix",
    "description": "By one of my favorite directors, Alex Garland. He also made the limited Series Devs. Annihilation is his second film as a writer/director and I was so hyped for it after seeing Ex Machina. It definitely deliverers. Maybe too scary for some, and too boring for others, but if you like science fiction, or good movies in general, you have to see this."
  },
  {
    "name": "Ex Machina",
    "platform": "Netflix",
    "description": "Sometimes this is not free on Amazon so you might have to spend 99 cents or something, but still. One of my favorite movies, and the directoral debut of Alex Garland, which is crazy to me."
  },
  {
    "name": "Soul",
    "platform": "Disney+",
    "description": "I did not have high expectations, but the Director Pete Docter also made Up and Inside Out, two Pixar movies I enjoyed. This one is fantastic, I was genuinely sad it did not come out in theaters. It made me pretty emotional and I cannot recommend it enough."
  }
]