[
  {
    "name": "This is Us",
    "platform": "Amazon",
    "description": "A lot of people love this drama about a family, playing out in two timelines. I watched a few episodes and they were fine but I should maybe give it another chance.",
    "type": "Show"
  },
  {
    "name": "Skin",
    "platform": "Amazon",
    "description": "Movie about a nazi who tries to quit being a nazi. It has an A24 logo on it so I don´t know what is keeping me.",
    "type": "Movie"
  },
  {
    "name": "Portrait of a Lady on Fire",
    "platform": "Amazon",
    "description": "The hype around this was just so big, and it´s on Amazon but I never get to watch it.",
    "type": "Movie"
  },
  {
    "name": "Underground Railroad",
    "platform": "Amazon",
    "description": "I want to watch this because it is made by Barry Jenkins, who directed the Oscar-Winning Moonlight.",
    "type": "Show"
  },
  {
    "name": "Mythic Quest",
    "platform": "Apple TV Plus",
    "description": "It is a workplace comedy about game developers. And it starrs Danny Pudi, aka Abed from Community.",
    "type": "Show"
  },
  {
    "name": "Atlanta",
    "platform": "Disney+",
    "description": "I searched for this for a long time, now it is on Disney+. Created by and starring Donald Glover aka Childish Gambino, so this should be interesting.",
    "type": "Show"
  },
  {
    "name": "The Flight Attendant",
    "platform": "Amazon",
    "description": "In case I need a crime show. It starrs Kaley Cuoco and got pretty good reviews.",
    "type": "Show"
  },
  {
    "name": "Minari",
    "platform": "Itunes",
    "description": "I still have to watch a lot of Oscar Movies. This starrs one of my favorites, Steven Yeun, so it is on the top of my list.",
    "type": "Movie"
  },
  {
    "name": "Judas and the Black Messiah",
    "platform": "Itunes",
    "description": "Another movie I have high expectations for. With even two favorites, Daniel Kaluuya and LaKeith Stanfield. Daniel won the Oscar for Best Supporting Actor for this.",
    "type": "Movie"
  }
]